{"pages":[{"title":"UDOO BOLT Docs","text":"","tags":"","url":"index.html"},{"title":"Introduction","text":"UDOO BOLT UDOO BOLT is a portable, breakthrough supercomputer that goes up to 3.6 GHz thanks to the brand-new AMD Ryzen™ Embedded V1000 SoC, a top-notch APU, multicore CPU with powerful integrated mobile GPU - AMD Radeon™ Vega 8 or AMD Radeon™ Vega 3 Graphics - and an integrated Arduino® Leonardo-compatible platform, all wrapped into one. On UDOO BOLT you can run all the software available for the PC world, from gaming to video streaming, from graphical editors to professional development platforms, plus all the software for the Arduino® Leonardo world, including all the sketches, libraries and the official Arduino® IDE. UDOO BOLT embeds two processors: the new AMD Ryzen™ Embedded V1000, V1605B or V1202B, 14nm, up to a 4-cores\/8-threads CPU, with a thermal design power of just 12-25W, designed for really fast Ultrathin Notebooks. This processor family brings together the breakthrough performance of the pioneering AMD “Zen” CPU and AMD “Vega” GPU architectures in a seamlessly-integrated SoC solution that sets a new standard in processing power for next-generation embedded designs. the Microchip ATmega32U4 8-bit AVR microcontroller, the same of Arduino® Leonardo. While the AMD Ryzen™ Embedded V1000 processor can run all the Windows 10 and Linux 64-bit Distros you want to use as desktop PC, the Microchip ATmega32U4 allows easy access to a Arduino® Leonardo environment. The main AMD Ryzen™ processor and the ATmega32u4 microcontroller are connected together through an internal USB serial connection, so it is exactly like you have an Arduino® Leonardo connected with a standard PC but all in small size form factor Single Board Computer. Download the User Manual to have more complete explanation of the UDOO BOLT hardware and features. Here you can find the Get Started and Safety instruction Manual for a quick installation. If you find any problem in the proper working of UDOO BOLT you can check the Troubleshooting page. Heads up! In order to prevent damages to your board, remember to: CE and FCC certifications retained using only the UDOO BOLT qualified Power Supply. When not using UDOO BOLT qualified Power Supply, use 19VDC (min 60W power) PSUs certified for your country (make sure that the power cable is less than 3 mt. long). CE and FCC certifications retained with the board inside the UDOO BOLT metal case. When not available, we suggest using a case with the same attributes as the UDOO BOLT metal Case. This product should be operated in a well-ventilated environment and, if used inside a case, the case should not be covered. This product should be elevated on a stable, flat, electrically non-conductive surface whilst in operation, and clear from any object that can induce a short-circuit. Do not expose it to water, moisture or heat from any source; UDOO BOLT is designed for reliable operation at normal ambient room temperatures. Avoid handling the warm and moving parts (like the fan) and generally the printed circuit board while it is powered. Only handle by the edges to minimise the risk of electrostatic discharge damage. Take care whilst handling to avoid mechanical or electrical damage to the printed circuit board and connectors. Also use a grounded wrist strap or touch a safely grounded object before you handle components. Never provide more than 5V in input to the GPIOs of the Arduino Leonardo-compatible(Atmel® ATmega32U4), and never provide more than 3.3V in input to the GPIOs of the Embedded Controller. Do not use a NON-standard USB 3.0 peripheral. If you use a non-standard USB 3.0 peripheral with an external power plug, this could send back the power source to the UDOO BOLT board with the risk of damage. The most important safety rule of all: Always Be Careful! (ABC) Lineup UDOO BOLT retail line up consists of two models. UDOO BOLT V8 UDOO BOLT V3 Check the Board Versions section to see the differences between the two. Technical specifications Processor: CPU AMD Ryzen™ Embedded V1605B SoC up to 3.6 GHz (V8 version) CPU AMD Ryzen™ Embedded V1202B SoC up to 3.2 GHz (V3 version) GPU: AMD Radeon™ Vega 8 Graphics - 8 GPU Compute Units (V8 version) AMD Radeon™ Vega 3 Graphics - 3 GPU Compute Units (V3 version) RAM: 2x SO-DIMM Dual-channel 64-bit DDR4 2400 MT\/s with ECC support up to 32GB Microchip ATmega32U4 8-bit AVR RISC-based microcontroller. Video interfaces: 2x HDMI 1.4\/2.0a 2x USB Type-C (DP alternate mode) Storage: 1x 32GB internal eMMC 5.0 High Speed Drive 1x M.2 Socket 2 Key B 2242\/2260 for SSD SATA modules (featured also PCI-e x2) 1x M.2 Socket 3 Key M 2280 for NVMe modules (PCI-e x4 Gen 3 interface) 1x SATA III 6Gbit\/s standard connector Networking: 1x Gigabit Ethernet LAN interface 1x M.2 Key E slot for optional Wireless (WiFi+BT) Combo module Audio interfaces: HD Audio Codec Realtek ALC888S Microphone + Headphone Combo Connector (TRRS) Pre-amplified stereo Speaker Connectors (up to 3W) Digital Optical audio S\/PDIF and analog stereo output combo jack 3.5mm connector 2x USB 3.0 type-A sockets 2x USB Type-C : USB 3.1 DisplayPort Alternate Mode Dual Role Port (DRP) USB Power Delivery (USB-PD) 3.0 Embedded Controller I\/O : 2x UART ports* 2x I2C interface* 1x SPI interface* 1x Keyboard Scan interface* 1x FAN Controller* up to 10x GPIO Power In: 19V DC Power Jack min 3.15A (60W) for basic functionalities - Male connector 4.5mm x 3.0mm with pin inside. 2x USB Type-C power in. PD sink profile 20V\/3A(60W). RTC Battery Connector + RTC Coin Battery Bi-color Power Status LED Arduino™ Leonardo-Compatible I\/O : 12x analog inputs* up to 23x digital input\/output (7 PWM)* 1x UART 1x I2C 1x SPI* 3x Grove connectors: 1x ANALOG INPUT, 1x UART or DIGITAL I\/O, 1x I2C or DIGITAL I\/O Dimensions: 12cm x 12cm - 4.72” x 4.72” *Available on Pin Headers Visit the official accessories. Community Official web site www.udoo.org Official web site dedicated page: tbu Official forum www.udoo.org\/forum Forums The official UDOO forums can be found at www.udoo.org\/forum The forum search facility has been tweaked to allow more general searching. Please do a search before making a post as the issue may already have been raised and answered. IRC channel There is an (unofficial) UDOO discussion channel on IRC. Using the IRC client of your choice, use server information: irc.freenode.net. Room name is #udoo. Social networks Facebook fan page Twitter Google+ YouTube Instagram","tags":"","url":"Introduction\/Introduction.html"},{"title":"Overview","text":"TOP AND BOTTOM VIEWS BLOCK DIAGRAM FULL SPECS AMD RYZEN™ EMBEDDED V1000 SOC Processor AMD Ryzen™ Embedded V1000 (V1605B - V1202B) series up to 3.6GHz in Boost mode Core Core Up to Quad Core\/Eight Thread Memory 2x Slot SO-DIMM Dual-channel 64-bit DDR4 2400 MT\/s with ECC support up to 32GB Graphics Up to AMD Radeon™ Vega 8 Graphics (8 GPU CU) Multimedia DirectX® 12 Technology, OpenCL, OpenGL, The Vulkan® APIH.265 Decode &amp; (8-bit) Encode, VP9 Decode Video Interfaces 2x HDMI 1.4 \/ 2.0a 2x DP Alternate Mode on USB Type-C Mass Storage eMMC 5.0 High Speed Drive 32 GB soldered on boardSATA III 6Gbit\/s standard connectorSSD SATA module's Slot M.2 Socket 2 Key B 2260 (featured also PCI-e x2)NVMe modules Slot M.2 Socket 3 Key M 2280 (PCI-e x4 Gen 3 interface) Networking Gigabit Ethernet Realtek RTL8111GSlot M.2 Socket 1 Key E 2230 for optional WiFi\/BT combo USB 2x USB 3 Type-A 2x USB Type-C: - USB 3.1 - DisplayPort Alternate Mode - Dual Role Port (DRP) USB Power Delivery (USB-PD) 3.0 Audio HD Audio Codec Realtek ALC888SMicrophone + Headphone Combo Connector (TRRS)Pre-amplified stereo Speaker Connectors (up to 3W)Digital Optical audio S\/PDIF and analog stereo output combo jack 3.5mm connector Other Interfaces Front Panel Headers, IR receiver (RC5 compatible), Fan controller, RTC battery included Embedded Controller I\/O Pins 2x UART, 2x I2C, 1x SPI, 1x Keyboard Scan, 1x FAN Controller, 10x GPIO Operating System Windows 10 64bitAny Linux Distribution for x86_64bit Board Dimensions 12cm x 12cm - 4.72” x 4.72” - Nano-ITX standard form factor ATMEL® ATMEGA32U4 MICROCONTROLLER Microcontroller Atmel® ATmega32U4 module Other Interfaces SPI Flash JTAG connector Arduino Pinout Easy to use with a custom 2 rows pinoutExpandable with I\/O shield to have the standard Arduino Pinour R3 Digital I\/O Pins up to 23x digital input\/output (7 PWM) Analog I\/O Pins 12 (10 Bits of resolution) Heads up! The communication between the AMD Ryzen™ Embedded V1000 SOC and the Microchip ATmega32U4 module comes through a USB interface, exactly like an Arduino&trade; Leonardo board connects to an external PC.","tags":"","url":"Hardware_References\/Overview.html"},{"title":"Resources","text":"UDOO BOLT Hardware and UEFI BIOS User Manual For a full explanation of UDOO BOLTS’ hardware download the UDOO BOLT Hardware and UEFI BIOS User Manual UDOO BOLT Get Started and Safety instruction Manual Here you can find all you need for a quick installation Get Started and Safety instruction Manual Mechanical Drawing - 3D Design Files Here you can find the mechanical specs files of the UDOO BOLT: Top Bottom UDOO BOLT 3D Design File UDOO BOLT Metal Case drawings UDOO BOLT Heatsink and fan drawings Heads up! Other files, like the schematics of the board, will be shared further on.","tags":"","url":"Hardware_References\/Resources.html"},{"title":"Board versions","text":"The only difference between the two versions of the UDOO BOLT (V8 and V3) is the AMD APU version. The main differences between the two versions of the AMD Ryzen™ v1000 Embedded APU are shown in the following table. V8 V3 Processor AMD Ryzen™ Embedded V1605B AMD Ryzen™ Embedded V1202B CPU Cores 4 Cores \/ 8 Threads 2 Cores \/ 4 Threads CPU Freq (Base\/Max) 2GHz \/ 3.6GHz 2.3GHz \/ 3.2GHz GPU AMD Radeon™ Vega 8 Graphics AMD Radeon™ Vega 3 Graphics GPU Max 1100 MHz 1000 MHz GPU CU 8 3 For a detailed comparison of the two processors follow this link: Processors specifications table For other info about the AMD Ryzen™ Embedded Processors series follow this link: AMD Ryzen™ Embedded Processors series","tags":"","url":"Hardware_References\/Board_versions.html"},{"title":"Memory Installation","text":"UDOO BOLT features 2x 260-pin SO-DIMM sockets for DDR4 memory (CN2 and CN3). Supports 4GB, 8GB and 16GB DDR4 SO-DIMMs up to maximum 32GB. Supports 1.2v DDR4-2400 SO-DIMM ECC and non-ECC memories with dual channel architecture. In order to exploit the Dual-Channel mode make sure that you install memory modules of the same type and density in different channel DIMM slots. If you want to use only 1 SO-DIMM module you can install it into either SO-DIMM slot CN2 or slot CN3. If you want to use 2 SO-DIMM modules you can install it into both the SO-DIMM slots CN2 and CN3. Memory Modules Installation Please only install DDR4 SO-DIMMs on UDOO BOLT. Only DDR4 are compatibles with UDOO BOLT, as there are physical differences between DDR3 and DDR4 memory modules. Check that all the notches line up with the DDR4 SO-DIMM slot to ensure you have the correct DIMM. Follow these steps to install the RAM modules: Pull both clips on either side of the slot outwards. Align the RAM SO-DIMM module with the slot. Press the module straight down until the plastic clips tick and close. Ensure that the module fits tightly into the SO-DIMM slot. Push the clips inwards to check. MOdule removal from a socket: gently spread the socket’s retention arms to disengage them from the SO-DIMM module. Heads up! Do not touch the RAM module contact edge to avoid damaging it. Validated modules Here you can find the RAM modules validated and tested with the UDOO BOLT, part of the family product Transcend DDR4-2400 SO-DIMM Transcend TS512MSH64V4H (RAM SO-DIMM Module 4GB (512Mx8 - 1Rx8) DDR4 1.2V PC4-2400 non-ECC - Lead Free) Transcend TS1GSH64V4B (RAM SO-DIMM Module 8GB (1024Mx8 - 1Rx8) DDR4 1.2V PC4-2400 non-ECC CL=17 - Lead Free) Transcend TS2GSH64V4B (RAM SO-DIMM Module 16GB (1024Mx8 - 2Rx8) DDR4 1.2V PC4-2400 non-ECC CL=17 - Lead Free) Please always use SO-DIMM modules with the same technical specification. Info In this thread of the UDOO Forum you can find an unofficial but useful discussion about others compatible memories: UDOO BOLT Memory Compatibility List","tags":"","url":"Hardware_References\/Memory_Installation.html"},{"title":"Video Output","text":"The Graphic controller of the UDOO BOLT is the integrated AMD Radeon™ Vega Graphics. Depending of the board version these are the specification: AMD Radeon™ Vega 8 Graphics - Up to 1100 MHz 8 execution units (BOLT V8) AMD Radeon™ Vega 3 Graphics - Up to 1000 MHz 3 execution units (BOLT V3) The AMD Radeon™ Vega Graphics controller, with 3 or 8 Execution units, offers extremely high graphical performances, supporting also High Dynamical range (HDR) Imaging. DirectX® 12, EGL 1.4, OpenCL 2.1, OpenGL® ES 1.1\/ 2.x \/ 3.x (Halti), OpenGL® Next (Vulkan®), OpenGL® 4.6 are also supported by this GPU, which can also offer H.265 10-bit video decoding and 8-bit encoding. Video Output Connectors The UDOO BOLT is able to drive 4x 4K independent displays, by using the 2x HDMI 2.0 and the 2x USB-C interfaces available. The AMD Ryzen Embedded V1000 family of Processors offer four Digital Display Interfaces, configurable to work in HDMI\/DVI\/DP++ modes. HDMI Connectors On the UDOO BOLT board, the Digital Display Interfaces #0 and #1 are used to implement two HDMI 2.0 interfaces through as many HDMI ReDriver \/ Level shifters and ESD protection + signal conditioning ICs. Maximum resolution: 4096x2160 @ 60Hz Heads up! Always use HDMI-certified cables for the connection between the board and the HDMI display; a category 2 (High-Speed) cable is recommended for higher resolutions, category 1 cables can be used for 720p resolution. You can use this HDMI to HDMI cable to connect to a HDMI display in 4k resolution. USB-C Connectors win DipslayPort Alternate Mode USB 3.1 Port #0 is internally multiplexed by the AMD Ryzen Embedded V100 Processor with Display Port #3, USB 3.1 Port #3 is multiplexed with Display Port #2., i.e. its can be used to support USB-C Displays or DP displays directly and, through an external adapter, also HDMI or DVI displays. The configuration of this interface in DP or HDMI\/DVI mode is automatic. Maximum resolution: 4096x2160 @ 60Hz In the market, you can find USB-C Touch Displays with a single USB-C cable to power the display, send the video signal and receive the touch signal. In addition, there are displays that provide power via USB-C. Once the display is connected to a standard power supply, they allow the UDOO BOLT to be powered by a single USB-C cable and receive the video signal.","tags":"","url":"Hardware_References\/Video_Output.html"},{"title":"Storage Options","text":"eMMC onboard UDOO BOLT features an embedded multi media card memory of 32GB. The eMMC use a e.MMC 5.1 HS400 compliant interface. Heads up! As a flash-based storage device, excessive drive access, particularly write commands, reduces its useful life. Therefore, it is strongly suggested to NOT create a swap partition on the eMMC device. M.2 SATA\/PCI-e x2 Slot: Socket 2 Key B type 2242\/3042\/2260 The mass storage capabilities of the UDOO BOLT are completed by an M.2 SSD Slot, which allows plugging M.2 Socket 2 Key B Solid State Drives with SATA interface or PCI-e x2 interface (PCI-e x1 is also supported). The connector used for the M.2 SATA\/PCI-e slot is CN18, is a standard 75 pin M.2 Key B connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA\/PCI-e modules in 2260 size. It is possible to also place modules in 2242 or 3042 size, by using a M\/F Spacer, which allows fixing the M.2 module on the spacer already available on the PCB, deemed for the fixing of the M.2 Key E. In the Official Accessories section you can find a M.2 SSD Transcend MTS600 2260 drive compatible with this connector, available in the UDOO shop. M.2 NVMe Slot: Socket 3 Key M Type 2280 Another possibility to connect mass storage devices is given by the M.2 Key M Slot, which allows the plugging of M.2 High Capacity SSD NVMe drives with PCI-e x4 interface. The connector used for the M.2 SSD slot is CN17, which is a standard 75 pin M.2 Key M connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 3 Key M PCI-e SSD modules in 2280 size. Info In this thread of the UDOO Forum you can find an unofficial but useful discussion about others compatible NVMe memories: NVME M.2 SSD Compatibility List SATA The AMD Ryzen™ Embedded V1000 family of Processors embed a SATA Controller, which offers two SATA III 6.0 Gbps interfaces. Of these interfaces, one SATA channel is carried out to a standard male S-ATA connector, CN14 (the other SATA channel is available on the M.2 Key B socket). A dedicated power connector CN15, can be used to give supply to 2.5&quot; Hard Disk Drives (or Solid State Drives) connected to the SATA male connector. The dedicated power connector is a 4-pin male connector. You can find this cable in the SATA data and power cables kit. Heads up! To connect a 3.5&quot; Hard Drive you need to provide SATA +5V+12V combo power supply from an external source.","tags":"","url":"Hardware_References\/Storage_Options.html"},{"title":"M.2 Connectors","text":"UDOO BOLT features two M.2 connectors on the bottom of the board. M.2 SATA\/PCI-e Slot: Socket 2 Key B type 2242\/3042\/2260 The mass storage capabilities of the UDOO BOLT are completed by an M.2 SSD Slot, which allows plugging M.2 Socket 2 Key B Solid State Drives with SATA interface or PCI-e x2 interface (PCI-e x1 is also supported). The connector used for the M.2 SATA\/PCI-e slot is CN20, which is a standard 75 pin M.2 Key B connector. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA\/PCI-e modules in 2260 size. In the Official Accessories section you can find a M.2 SSD Transcend MTS600 2260 drive compatible with this connector, available in the UDOO shop. It is possible to also place modules in 2242 or 3042 size, by using a M\/F Spacer, which allows fixing the M.2 module on the spacer already available on the PCB, deemed for the fixing of the M.2 Key E. The PCI-e x2 interface can also be used for different purposes other than SSD modules, but it is important that the CONFIG_1 signal is driven properly (it can be left unconnected on PCI-e based modules, due to the presence of the pull-up resistor on the platform). For example you can connect other accessories as the official M.2 dual Ethernet Module Kit or an adapter from M.2 to PCI-e 2x as used in this project to connect an external GPU. M.2 NVMe Slot: Socket 3 Key M Type 2280 Another possibility to connect mass storage devices is given by the M.2 Key M Slot, which allows the plugging of M.2 High Capacity SSD NVMe drives with PCI-e x4 interface. The connector used for the M.2 SSD slot is CN17, which is a standard 75 pin M.2 Key M connector, located at the bottom of the board. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 3 Key M PCI-e SSD modules in 2280 size. Searching in the web, you can also find M.2 Key M to PCI-e 4x to connect an external GPU. For example, we used this one or this other and they work good and can be used also with the board inside the official UDOO BOLT metal case. These accessories are not supported by UDOO. M.2 Connectivity Slot: Socket 1 Key E Type 2230 It is possible to increase the connectivity of the UDOO BOLT board by using M.2 Socket 1 Key E connectivity modules (i.e. modules with functionalities like WiFi + Bluetooth). The connector used for the M.2 Connectivity slot is CN19, which is a standard 75 pin M.2 Key E connector. On the UDOO BOLT board there is also a Threaded Spacer which allows the placement of M.2 Socket 1 Key E connectivity modules in 2230 size. In the Official Accessories section you can find a M.2 Wi-Fi Intel dual band ac Wi-Fi + BT 4.2 5ghz + adhesive antenna module compatible with this connector, available in the UDOO shop.","tags":"","url":"Hardware_References\/M.2_Connectors.html"},{"title":"Pinout Headers","text":"UDOO BOLT features two pinout headers (dual-row 40 Pins), one on the top(CN24) and another on the bottom(CN25) of the board. CN24 - Top: The pin header connector on the top of the board is connected to the ATmega32U4 microcontroller (Arduino® Leonardo-compatible). Check the Arduino Leonardo-compatible(ATmega32U4) Pinout section to know how to use it through the Arduino® programming. CN25 - Bottom: The pin header connector on the bottom of the board is connected to the Embedded Controller(MEC1705). The EC is used to manage some functionalities of the board like the fan management, the wake up of the Ryzen™ processor and others. The EC also manages the exposed buses in the CN25 pinout header like UART, I2C, etc. and these are usable from the main AMD Ryzen™ processor. _ Since the Arduino Pinout connector (CN24) is fully described in the dedicated section, we describe only the pinout header of the EC (CN25) in this page. Embedded Controller I\/O Pin header - CN25 The Embedded Controller input\/output (I\/O) pins operate at 3.3V. ⚠️ Warning: UDOO BOLT Pins controlled by the Embedded Controller are 3.3V compliant. Providing higher voltages, like 5V or 12V, could irreversibly damage the board. In order to properly work with an input voltage different from 3.3V you can use a bidirectional level shifter. Pinmuxing The image below shows the list of all possible functions assigned to each Pin. _ Here you can find the Embedded Controller [Microchip MEC1705 datasheet](http:\/\/ww1.microchip.com\/downloads\/en\/DeviceDoc\/MEC170x-Data-Sheet-DS00002206D.pdf). UART 0 and UART 1 Universal Asynchronous Receiver\/Transmitter (UART) provides serial communication capability with external devices. The UART 0 is available at Pins 34, 36, 38, 40. The UART 1 is available at Pins 33, 35, 37, 39. UART 0 Pin Function EC PAD 34 UART0_RX UART0_RX 36 UART0_TX UART0_TX 38 UART0_RTS UART0_RTS# 40 UART0_CTS UART0_CTS# UART 1 Pin Function EC PAD 33 UART1_RX UART1_RX 35 UART1_TX UART1_TX 37 UART1_RTS UART1_RTS# 39 UART1_CTS UART1_CTS# Accordingly to the Microchip MEC1705 datasheet these are full-function Serial Port that supports the standard RS-232 Interface. The baud rate goes from 50 to 3000000. The UARTs are directly propagated to the OS as Legacy UART so you can already interact with they. UARTs on Linux On Linux the UARTs are seen as standard tty devices. The addresses are set by default to 0x3f8 and 0x2f8. You should find the UARTs available on the devices \/dev\/ttyS0 and \/dev\/ttyS1 on Ubuntu with a baudrate of 115200. The device name assigned by the Linux Distro you are using can change, you can check the name assigned running the command: dmesg | grep tty UARTs on Windows 10 On Windows the UARTs are seen as standard COM devices. The addresses are set by default to 0x3f8 and 0x2f8. You should find the UARTs available on the devices COM1 and COM2 on Windows 10. I2C 1 and I2C 2 The I2C (Inter-IC) bus is a bi-directional, two-wire serial bus that provides a communication link between integrated circuits (ICs). Phillips introduced the I2C bus 20 years ago for mass-produced items such as televisions, VCRs, and audio equipment. Today, I2C is the de-facto solution for embedded applications. The I2C 1 is available at Pins 8, 10. The I2C 2 is available at Pins 7, 9. I2C 1 Pin Function EC PAD 8 I2C1_SCL I2C08_SCL 10 I2C1_SDA I2C08_SDA I2C 2 Pin Function EC PAD 7 I2C2_SCL I2C09_SCL 9 I2C2_SDA I2C09_SCL Check the Microchip MEC1705 datasheet for more info about the I2C interface. You can use the I2C exposed by the EC using the EAPI libraries in your software. SPI The Serial Peripheral Interface (SPI) is a synchronous serial communication interface specification used for short-distance communication, primarily in embedded systems. The SPI may be accurately described as a synchronous serial interface, but it is different from the Synchronous Serial Interface (SSI) protocol, which is also a four-wire synchronous serial communication protocol. The SPI is available at Pins 1, 2, 3, 4. Pin Function EC PAD 1 SPI_MISO SPI0_MISO 2 SPI_CS# SPI0_CS# 3 SPI_MOSI SPI0_MOSI 4 SPI_CLK SPI0_CLK You can use the SPI exposed by the EC using the EAPI libraries in your software. Fan Controller You can control an external Fan using the Fan Controller Pins. The Fan controller is available at Pins 11, 12. Pin Function EC PAD 11 FANOUT0 PWM0 12 FANTACH0 FAN_TACH0 The Fan Out is used as a PWM output to control the Fan Speed. The Fan Tachometer is used as in Input to capture the Fan Speed. Remember you also need to provide the Voltage and Ground Pins to the external Fan. These two signals (out and tachometer) are only 3.3V digital pins exposed by the controller and therefore do not deliver power. To drive a 3-pin fan you need a power circuit that gives the right voltage to the fan. For example, this is the circuit used to drive the 5V fan installed above the heatsink: You can control these Fan Pins using the EAPI libraries in your software. Wake Pins The Wake pin can be used as an interrupt, the signal is caught by the EC and propagated to wake up the main AMD Ryzen™ processor from S3\/S4\/S5 status (Suspend\/Hibernate\/Power Off). The Wake is available at Pin 6. Pin Function EC PAD 6 WAKE# GPIO025 The wake signal is activated by a logical state change on the Pin (e.g. active low from 3.3V to GND). Keyboard Scan The Keyboard Scan Interface block provides a register interface to the EC to directly scan an external keyboard matrix of size up to 11x5. KS Input [4:0] : Column inputs from external keyboard matrix. KS Output[10:0]: Row outputs to external keyboard matrix. The Keyboard Scan is available at Pins from 13 to 28. Pin Function EC PAD 13 KSO0 KSO00 14 KSI0 KSI0 15 KSO1 KSO01 16 KSI1 KSI1 17 KSO2 KSO02 18 KSI2 KSI2 19 KSO3 KSO03 20 KSI3 KSI3 21 KSO4 KSO04 22 KSI4 KSI4 23 KSO8 KSO08 24 KS11 KSO11 25 KSO9 KSO09 26 KSO12 KSO12 27 KSO10 KSO10 28 KSO13 KSO13 You can use these Pins as GPIO exposed by the EC using the EAPI libraries in your software.","tags":"","url":"Hardware_References\/Pinout_Headers.html"},{"title":"Power Sources","text":"Input You can power up the board in 2 ways: 19V DC Power Jack min 3.15A (60W) for basic functionalities. 2x USB Type-C power in. PD sink profile 20V\/3A(60W). A bicolour Green\/Yellow LED is placed near the DC IN power jack (CN5) to signal the power state of the board. When the board is powered but turned off, then the LED turns on Yellow, during normal working (S0 State) the LED turns on Green light. DC Power Jack The UDOO BOLT board can be supplied with an external 19VDC ± 5% power supply, minimum 60W (i.e. min. 3.15A @ 19V) for basic functionalities recommended. Heads up! Always make sure that the power cable is less than 3mt. long. This voltage can be supplied through a DC power jack (CN5). Mating DC plug is a male connector 4.5mm x 3.0mm with pin inside. Heads up! CE and FCC certifications retained using only the UDOO BOLT qualified Power Supply you can find in the UDOO Shop. When not using UDOO Bolt qualified Power Supply, use 19VDC (min 60W power) PSUs certified for your country USB Type-C The Board can also be powered by using a standard USB-C power adapter thanks the Power Delivery in Sink mode. You can use either one of the two USB Type-C connectors (CN8, CN9). The PD Sink power profile is 20V 3A. Info In this thread of the UDOO Forum you can find an unofficial (but really useful) discussion about others compatible power supplies: Power supply compatibility list Output USB Type-C In Power Delivery Source Mode (in output from the Bolt to a USB device) the output is 5V 3A max per port with an overall budget of 4A, ie if a device connected to one port is consuming 3A, the other port has maximum 1 other Ampere to be given in output. USB 3.0 Type A The output from a USB 3.0 Type A to a USB device is the standard for USB3 specs, up to 900mA (0.9A).","tags":"","url":"Hardware_References\/Power_Sources.html"},{"title":"Official Accessories","text":"In the UDOO Shop you can also find some accessories for the UDOO BOLT. M.2 Modules M.2 SSD Transcend MTS600 2260 Buy it from the shop Capacity: 128GB\/256GB\/512GB Dimensions: 60.0mm × 22.0mm × 3.58mm (2.36&quot; x 0.87&quot; x 0.14&quot;) Weight: 6g (0.21 oz) Storage Media: MLC NAND Flash memory Operating Voltage: DC 3.3V±5% Operating Temperature: 0°C (32°F) to 70°C (158°F) For more info about this SSD module you can check the official Transcend page To mount the SSD is necessary the following fixtures (included with the board): 1x M3x4mm Screw M.2 Wi-Fi Intel dual band ac Wi-Fi + BT 4.2 5GHz + adhesive antenna Buy it from the shop The package includes: Wi-Fi AC and Bluetooth 4.2 module Intel® Dual Band Wireless Wi-Fi AC and Bluetooth 4.2 module (AC3168) Dimensions: 4.9 x 3.5 x 0.4 inches Weight: 8.5g (0.3 oz) M.2 compatible RF micro coax type connector 2x Antennas IPEX MFH-4 connector 10cm IPEX cable Adhesive backing on aerial plates For more info about this WiFi\/BT module you can check the datasheet from the Intel website Heads up! Intel® Dual Band Wireless Wi-Fi AC and Bluetooth 4.2 module (Intel® AC3168) was released in 2016 so we suggest to use a recent distribution to find the latest drivers already installed. If you are using a Linux distribution you need at least the v4.6 of the Linux Kernel to make this module work properly. Heads up! You need both the antennas to make the module work properly. Connect an antenna to the Main A connector to enhance Wi-Fi signal. Connect an antenna to the Aux B connector to enhance Bluetooth and BluetoothLE signal. To mount the WiFi\/BT Kit the following fixtures are necessary(included with the board): 1x M3x4mm Screw M.2 dual Ethernet Module Kit Buy it from the shop This module is based on 2x Realtek 8111GS Ethernet controllers (fully compliant with IEEE 802.3, IEEE 802.3u, IEEE 802.3ab). When the M.2 dual Ethernet Module Kit accessory is plugged into M.2 Key B slot, the UDOO BOLT board will offer three different Gigabit Ethernet ports. To mount the M.2 dual Ethernet Module Kit the following fixtures are necessary (included with the board): 1x M3x4mm Screw Mounting a M.2 accessory Mount the M.2 devices with the same metal screws that you find with the board when you purchased it. If the screws are no longer available, take care to use a metal one with the same characteristics as the one supplied - M3x4mm. Displays 7inch HDMI\/USB Display\/Touch Buy it from the shop The 7inch HDMI\/USB Display\/Touch has a 1024×600 pixel resolution and is supported by Windows 10\/8.1\/8\/7, Linux, and Android Operating System Display Features: 1024×600 high resolution; Resistive touch control; Compatible and Direct-connect with UDOO BOLT with Windows 10 and Linux Operating Systems; Also works as a computer monitor, in this case, touch panel is unavailable and HDMI cable is required; HDMI interface for displaying, no I\/Os required (however, the touch panel still needs I\/Os); Multi-languages OSD menu, for power management, brightness adjustment, contrast adjustment, etc; Supports 100-level backlight adjustment. To use it just: 1- Turn On the “backlight” switch on the back of the LCD; 2- Connect the Touch ports on your UDOO. The device will be recognized automatically; 3- Connect the HDMI port of the LCD to the HDMI port on your UDOO with an HDMI cable. Heads up! When multiple displays are detected by your UDOO, the LCD can only be used to control the cursor on main displays. So it is proposed to set the LCD as the main display. If you're looking for more info about this screen you can check the wiki page of the manufacturer: 7inch_HDMI_LCD_(C) Cases Metal Case Buy it from the shop A beautiful metal case for your UDOO BOLT. Heads up! Please notice that the case does not dissipate heat itself, but it allows the airflow to dissipate the board properly using the processor fan. Check the mechanical drawing to see the case dimensions. UDOO BOLT METAL CASE includes: 1x Sheet Metal Internal Part; 1x Extruded Metal external Part; 1x accessory kit: 4x M3x6mm pan head screw, cross recessed 4x M3x6mm countersink screw, cross recessed 4x M2.5x6mm countersink screw, cross recessed 1x Light Pipe 1x Rubber stop for light pipe 4x M4x12mm countersink screw, cross recessed 4x M3 washer 1x Momentary Push Button 12mm 4x Rubber feet The case features in the bottom 4 holes standard VESA MIS-D 100 (100mm x 100mm) to mount the entire case behind a monitor VESA compatible with the included screws. Always in the bottom part there are other 4 holes and the empty space to fix a 2.5&quot; Sata hard drive. The case also features two holes in the back side, to connect the WiFi externally and BT antennas of the M.2 module through a RP-SMA connector. For example you can use 2x IPEX MFH-4(W.FL) to RP-SMA cables and 2x RP-SMA antennas like in the following image. Heads up! These items are not included. Cables and Others Cables HDMI to HDMI - HDMI A Male to A Male Cable 2MT: Supports Ethernet, 3D, 4K video and Audio Return Channel (ARC) SATA data and power cables kit - SATA data and power cables for UDOO BOLT (CN18 and CN30 connectors) USB-C HUB - It includes 3x USB Type-A and 1GB Ethernet ports Power Supply 19V 65W AC power adapter Input: 100-240VAC 50\/60Hz Output: 19V 3.42A DC Output plug: 4.5mm * 3mm * 10mm USA Power Cable - The USA power cable that you need to use with the 19V 65W AC power adapter EU Power Cable - The EU power cable that you need to use with the 19V 65W AC power adapter","tags":"","url":"Accessories\/Official_Accessories.html"},{"title":"Linux","text":"UDOO BOLT is a Single Board Computer based on the AMD Ryzen™ Embedded V1000 family of System-on-Chips (SoCs), a series of Dual or Quad Core, 14nm, SoCs with 64-bit instruction set and very low TDP. The UDOO BOLT supports all the x86 Linux distributions 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit OS version. In the Getting Started section you can find a guide of how to install a Linux distro, the example is based on the Ubuntu OS. Heads up! There is a known issue with amdgpu driver which comes with 18.04 LTS and maybe others Linux distros. During and after OS installation it is possible that you may receive a UI after login or you may not. Check the Known issues section to know how to deal with it. If you are looking for the Linux Drivers for the V1000 Processors you can check the Linux Drivers section. Heads up! The AMD processors of the UDOO BOLT and the Wi-Fi\/BT module are released only few time ago so we suggest to use a recent distribution to find all the latest drivers already installed and all working properly. Ubuntu 19.04 Disco Dingo with amdgpu graphics and eMMC support Due to the known issues with some Linux distributions, we've created an installer image of Ubuntu 19.04 Disco Dingo optimized for UDOO BOLT. This image will install Ubuntu 19.04 with the mainline Linux Kernel 5.2.10 that already includes the AMD eMMC Driver for the Ryzen v1000 series processors. Using this image you will not need to use nomodeset procedure to workaround the issue that afflicts amdgpu graphics in previous versions. Ubuntu 19.04 - UDOO BOLT eMMC installer image SHA1SUM: d14f12d15f49c2356bfff14ad4a4366fefd83cc5 ubuntu-19.04.0-udoo-bolt-emmc-desktop-amd64.iso In the Getting Started section you can find a guide on how to install a Linux distro. You basically need to create a bootable USB with a tool like rufus on Windows or Startup Disk Creator on Linux or similar, and boot the board from that USB to start the installation wizard. Famous Linux distributions Here you can find an unordered list of 10 of the most popular Linux distributions: Ubuntu: is probably the most well-known Linux distribution. Ubuntu is based on Debian, but it has its own software repositories. Much of the software in these repositories is synced from Debian’s repositories. Ubuntu 19.04 Disco Dingo is the latest Ubuntu released version. Ubuntu 18.04 LTS Bionic Beaver is the latest Long Term Support version with a support end of life on April 2023. In the V-Series V1000 Drivers &amp; Support | AMD page you can find AMD stable drivers to support Ubuntu 18.04.1 LTS. Linux Mint is a Linux distribution built on top of Ubuntu. It uses Ubuntu’s software repositories, so the same packages are available on both. Originally, Mint was an alternative distribution loved mainly because it included media codecs and proprietary software that Ubuntu didn’t include by default. Debian is an operating system composed only of free, open-source software. The Debian project has been operating since 1993 — over 20 years ago! This widely respected project is still releasing new versions of Debian, but it’s known for moving much more slowly than distributions like Ubuntu or Linux Mint. This can make it more stable and conservative, which is ideal for some systems. Arch Linux is more old school than many of the other Linux distributions here. It’s designed to be flexible, lightweight, minimal, and to “Keep it Simple.” Keeping it simple doesn’t mean Arch provides tons of graphical utilities and automatic configuration scripts to help you set up your system. Instead, it means Arch dispenses with that stuff and gets out of your way. Fedora is a project with a strong focus on free software — you won’t find an easy way to install proprietary graphics drivers here, although third-party repositories are available. Fedora is bleeding edge and contains the latest versions of software. CentOS \/ Red Hat Enterprise Linux Red Hat Enterprise Linux is a commercial Linux distribution intended for servers and workstations. It’s based on the open-source Fedora project, but is designed to be a stable platform with long-term support. CentOS and Red Hat recently announced they’re collaborating, so CentOS is now part of Red Hat itself. openSUSE \/ SUSE Linux Enterprise openSUSE is a community-created Linux distribution sponsored by Novell. Novell purchased SuSE Linux in 2003, and they still create an enterprise Linux project known as SUSE Linux Enterprise. Where Red Hat has the Fedora project that feeds into Red Hat Enterprise Linux, Novell has the openSUSE project that feeds into SUSE Linux Enterprise. Mageia and Mandriva Mageia is a fork of Mandriva Linux created in 2011. Mandriva — known as Mandrake before that — was once one of the great user-friendly Linux distributions. Slackware Linux is another institution. Founded in 1993, Slackware is the oldest Linux distribution that’s still maintained and putting out new releases today. Puppy Linux is another fairly well-known Linux distribution. Previous versions have been built on Ubuntu, but the latest is built on Slackware. Puppy is designed to be a small, lightweight operating system that can run well on very old computers. Others useful distributions: LibreELEC – Just enough OS for KODI Kodi is a free and open-source media player software application developed by the XBMC Foundation. LibreELEC (short for Libre Embedded Linux Entertainment Center) is a distro based on Kodi, is a non-profit fork of OpenELEC as an open source just enough OS (JeOS) Linux software appliance distro for Kodi. Lakka is a lightweight Linux distribution that transforms a computer into a full blown game console for retrogaming. source www.howtogeek.com To help choosing your favorite distro you can also check this linux.org article. A very updated resource to watch &quot;which is the most used Linux Distro&quot; and to choose one is Distro Watch","tags":"","url":"Operating_Systems\/Linux\/index.html"},{"title":"Known issues","text":"The reported known issues in this page are already solved in the Ubuntu 19.04 image we've published in the start page of the Linux section. amdgpu drivers issue in Ubuntu 18.04 - 'nomodeset' procedure Info! Newer versions of Ubuntu than 18.04 are not affected by this issue so you don't need to use this procedure. There is a known issue with amdgpu driver which comes with Ubuntu 18.04 LTS (and maybe others Linux distros). During and after OS installation it is possible that you may receive a UI after login or you may not. You can find all the references about this issue in the amdgpu Documentation (amdgpu_UserGuide) in the driver packages downloadable from the AMD official website. Check the Linux Drivers section to download the latest driver package. If you experience this problem during the installation of Ubuntu 18.04 LTS (or in a different Linux distro) follow the instructions below or install a newer version of Ubuntu or the optimized version of Ubuntu 19.04 we've published in the start page of the Linux section To workaround this issue you need to start the installation by adding nomodeset parameter to grub. Adding nomodeset doesn’t load amdgpu driver which comes with Ubuntu 18.04 LTS and you will get the UI after login. Procedure to add nomodeset to grub: Stop the installation to the grub menu. Press e to edit the menu entry you choose (e.g Install Ubuntu) and it will lead to edit the boot parameters. Find the line which ends with quiet splash and add nomodeset in front of it. So it becomes nomodeset quiet splash. Whatever is there in front of it leave it as it is just add nomodeset in front of quiet splash. Press Ctrl+X or F10 to boot with this new parameter. You can check this post or this other post to see an image that will let better understand where to put the nomodeset parameter. Editing the grub like this is just a temporary fix, you probably will need to repeat the procedure after the installation to boot the system. After you've installed Ubuntu 18.04 LTS you can install the AMD drivers following the Linux Drivers section, to have a proper working system. If you don't need the AMD drivers you can set the fix the nomodeset boot option permanently so that you don't have to go through this manual procedure again following the instructions in this post. eMMC Usage and Installation Info! The Linux Kernel mainline with version &gt;=5.2.5 includes support for the AMD eMMC driver for Ryzen v1000 embedded series processors. Some Linux distributions with a kernel version &gt;=5.2.5 such as ArchLinux or Manjaro have already been released and support correctly the UDOO BOLT eMMC. Unfortunately, the AMD eMMC driver for the Ryzen v1000 embedded series processors was not included in the mainline Linux Kernel before version 5.2.5, so it will not be possible to install a standard Linux distribution on the eMMC with an older kernel than that version(&lt; 5.2.5) onboard the UDOO BOLT eMMC without some tweaks. To install a Linux distro with a kernel older than 5.2.5 on the eMMC, a kernel patch released by AMD is needed. The package released by AMD is going to guide you through a creation of a Ubuntu 18.04.1 installation image .iso file with the Linux Kernel 4.15.18 patched to support the AMD eMMC driver, you can download the patch here: emmc_v1000_patch.zip SHA1SUM: 6FB569D462701E16F70405BC107CE0F91C87F26C emmc_v1000_patch.zip We recompiled the AMD kernel source contained in the GPU driver package by adding the patch for eMMC support and you can download them here: udoo_bolt_linux-4.19.8_amd64_amdgpu_emmc.tar.gz SHA1SUM: bd546f5497069ce35af5c18112ebd0f314fa6115 udoo_bolt_linux-4.19.8_amd64_amdgpu_emmc.tar.gz Extract the package and install the custom kernel using the command dpkg -i with the three .deb files in the package.","tags":"","url":"Operating_Systems\/Linux\/Known_issues.html"},{"title":"Drivers","text":"AMD Vega graphics card used by the UDOO BOLT is fully supported in Linux. In this page you can find anything you need to know regarding the Linux Drivers. AMDGPU and AMDGPU-Pro AMDGPU is AMD's fully open source unified graphics Linux driver included in the mainline Linux Kernel for Vega GPUs and Raven Ridge APUs. AMDGPU-PRO is the closed source component that operates on top of the open source AMDGPU for alternative 3D application. from the Gentoo Linux docs we report an exhaustive explanation of the situations in which it is convenient to use one or other version of the driver: Users whose main use for their graphics card is gaming and other general home-use graphical hardware acceleration should use the open source AMDGPU drivers, since the performance of the open source drivers can be as much 100% more compared to AMDGPU-Pro. However, the PRO driver provides a few features that Mesa still lacks, namely OpenGL compatibility profiles, OpenCL 2.0, and a fully conformant Vulkan implementation. Also, most of the games for which Mesa outperforms the closed-source driver run in Wine, rather than natively. Thus, the closed-source driver is mostly useful to users who want to play games (such as Civilization V) or use applications (such as UCSF Chimera) that rely on compatibility profiles, or want to run anything that uses Vulkan with advanced shaders, or want to fully exploit OpenCL. Info For most of the users so the amdgpu open source drivers are enough and work well for all the test we made. AMDGPU If you want to use the amdgpu open source drivers, all you have to do is install a Linux distribution. The amdgpu drivers are already included in the mainline Linux Kernel so they will be loaded by default at boot time. Heads up! Always remember to keep updated the kernel you are using to have the latest available fixes for performance and stability. AMDGPU-Pro In order to download the latest stable updated version of the AMDGPU-Pro drivers for the Ryzen™ v1000 Embedded Series processors you can visit this page: V-Series V1000 Drivers &amp; Support | AMD . You can also reach this page from the standard AMD Support page choosing the menu entries Embedded -&gt; AMD Ryzen™ Embedded V-series Processors -&gt; V-Series V1000. The OS supported by these drivers in the Linux x86_64 version is Ubuntu 18.04.1 LTS. In the package you can find Documentation in the doc folder. Check the file amdgpu_UserGuide.pdf with the instructions to know how to install drivers. Heads up! We suggest to patiently read the amdgpu_UserGuide Documentation to properly install the drivers. The easiest way to properly install the AMD drivers is by using all the pre-compiled packages (kernel and user-space) following the section 2.2 Installation Procedure for amdgpu from Debian Binaries. You just need to run the install_debs.sh script that takes care of all the installations and setup needed. Inside the package folder open a terminal and run the following commands: sudo chmod +x install_debs.sh sudo .\/install_debs.sh If you need, you will also find in the AMD package all the documentation and resources to compile the AMD kernel and user space packages on your own.","tags":"","url":"Operating_Systems\/Linux\/Drivers.html"},{"title":"Windows","text":"UDOO BOLT is a Single Board Computer based on the AMD Ryzen™ Embedded V1000 family of System-on-Chips (SoCs), a series of Dual or Quad Core, 14nm, SoCs with 64-bit instruction set and very low TDP. Thanks to the x86_64 instruction set, the UDOO BOLT supports the Windows 10 distribution for 32-bit(aka i386, IA-32, x86-32, x86_32) and 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit Windows 10 version. Heads up! Please notice that usually you need a 64-bit OS version to exploit more than 4GB of RAM. Total amount of memory available with a 32-bit OS depends on the OS itself (less than 4GB, however). If you installed more than 4GB, please use a 64-bit version of Windows 10. In the Getting Started you can find a guide on how to install Windows, the example is based on Windows® 10 64-bit. Heads up! The AMD processors of the UDOO BOLT were released recently so we suggest to always keep updated Windows® 10 64-bit version and the AMD drivers to insure all features work properly. In order to download the latest stable updated versions of the AMD Ryzen™ drivers for the v1000 Embedded Series processors you can visit this page: V-Series V1000 Drivers &amp; Support | AMD . You can also reach this page by the standard AMD Support page choosing the menu entries Embedded -&gt; AMD Ryzen™ Embedded V-series Processors -&gt; V-Series V1000. You can find the AMD Catalyst Windows® 64-bit Display Driver for Windows 10 (64-Bit Edition). Install the latest software to exploit all the functionalities of the AMD Vega GPU.","tags":"","url":"Operating_Systems\/Windows.html"},{"title":"Overview","text":"The UDOO BOLT embeds a Microchip ATmega32u4 microcontroller, the same as Arduino® Leonardo, with the same open-source schematic. The main AMD Ryzen™ processor and the ATmega32u4 microcontroller are connected through an internal USB serial connection, so it’s exactly like having an Arduino® Leonardo connected with a standard PC but all in a small form factor Single Board Computer. The ATmega32u4 microcontroller is a low-power Microchip 8-bit AVR RISC-based microcontroller featuring 32KB self-programming flash program memory, 2.5KB SRAM, 1KB EEPROM, USB 2.0 full-speed\/low speed device, 12-channel 10-bit A\/D-converter, and JTAG interface for on-chip-debug. The device achieves up to 16 MIPS throughput at 16 MHz. 2.7 - 5.5 Volt operation. More technical information about ATmega32u4, like the datasheet, can be found in the Microchip ATmega32u4 page. From the Arduino Leonardo page: &quot;The Arduino Leonardo is a microcontroller board based on the ATmega32u4 (datasheet). It has 20 digital input\/output pins (of which 7 can be used as PWM outputs and 12 as analog inputs), a 16 MHz crystal oscillator, a micro USB connection, a power jack, an ICSP header, and a reset button. It contains everything needed to support the microcontroller; simply connect it to a computer with a USB cable or power it with a AC-to-DC adapter or battery to get started. The Leonardo differs from all preceding boards in that the ATmega32u4 has built-in USB communication, eliminating the need for a secondary processor. This allows the Leonardo to appear to a connected computer as a mouse and keyboard, in addition to a virtual (CDC) serial \/ COM port. It also has other implications for the behavior of the board; these are detailed on the getting started page.&quot;","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Overview.html"},{"title":"Getting Started with Arduino Leonardo","text":"To start programming the Arduino® Leonardo-compatible embedded microcontroller of the UDOO BOLT you need the Arduino IDE or the Arduino Web IDE. You can refer to the Arduino Leonardo page and the Getting Started with the Arduino Leonardo page on Arduino®'s website. The getting started Arduino page will guide you through the installation of the IDE, Drivers, first example and everything you need to program the Arduino Leonardo and how to use the pinout. You can also find useful tutorials and a useful &quot;please read...&quot; section with lot of specific information for Arduino Leonardo. USB Devices The USB serial device where you can find the Arduino Leonardo-compatible (ATmega32U4) embedded may vary in accordance with the number of USB devices connected to the board. Usually, you should find the Arduino Leonardo-compatible in the COM3 in Windows 10 and \/dev\/ttyACM0 in Unix\/Linux OS. Linux Installation There are known issues with the Arduino® IDE on Linux that can lead to malfunctions and difficulties in uploading sketches. These known issues have been solved by Arduino (from version 1.8.6 of the IDE) with a script to launch immediately after installing the IDE on the system. We suggest so to use the scripts contained in the Arduino package to install the software and fix these issues. After downloading the package from the official website, and extracting it, you should then run the following commands in a terminal to install the Arduino IDE on your Linux system: sudo .\/install.sh .\/arduino-linux-setup.sh $USER Known issues Heads up! The arduino-linux-setup.sh above will solve the issues of user permissions and sketch upload described below. If you are working with an old version of the IDE where this script is not present you can try to copy it from a new version or manually fix the issues as described below. User permissions Some Linux distributions need to be configured to gain upload permissions to the user to the Arduino tty port. If you find some complications in uploading the Arduino sketch(firmware) through the Arduino IDE, try to add your Linux user to the dialout group with this command: sudo usermod -a -G tty &lt;yourUserName&gt; sudo usermod -a -G dialout &lt;yourUserName&gt; where &lt;yourUserName&gt; is your Linux user name. You will need to log out and log in again for this change to take effect. Sketch upload ModemManager conflict If you have issues when trying to upload a sketch on the Arduino Leonardo-compatible ATmega32U4 of UDOO BOLT you probably have a conflict with the program ModemManager (installed by default on many Linux distros like Ubuntu). Modem Manager tries to open any serial port (ttyACM0 of the Arduino Leonardo included) checking if it's a modem and this usually creates conflicts with the upload mechanism. If you have installed ModemManager on your Linux you can try to disable or uninstall it (https:\/\/askubuntu.com\/questions\/216114\/how-can-i-remove-modem-manager-from-boot) Since you probably don't have a modem on your UDOO BOLT you can safely uninstall the package to solve the issue or disable it running the commands: sudo systemctl stop ModemManager.service sudo systemctl disable ModemManager.service After this procedure, you should be able to proceed normally and upload the sketch to your board or use the Serial Monitor. The solution of this issue was found in this thread of the Arduino Forum. How to restore the correct uploading state of sketches If you have not taken into account the possible conflict between ModemManager and sketch upload and you have not followed the instructions listed above, it may happen that the Arduino microcontroller is set in a state where the operating system does not see the serial port. This no longer allows you to load the sketch also using a different operating system. To exit from this state you can try to perform the procedure indicated by the Arduino Leonardo page. Pressing the Arduino physical reset button with the right timing it is possible to load a sketch when the serial port of the bootloader is exposed and restore the correct functioning of the ATmega32U4 microcontroller of Arduino Leonardo. Summarising, you need to hit the Arduino IDE Upload button and press the Arduino physical reset button with the right timing immediately after you see the message &quot;Uploading...&quot; appear in the software's status bar. Enable the verbose option of the Arduino IDE upload process can be very useful to understand when to correctly press the reset button . To do so, go to the menu File -&gt; Preference and check the upload option box in the &quot;Show verbose output during&quot; section. The correct time to press the reset button is when starts to appear PORT {} \/ {} =&gt; {} in the log. The IDE will see that port appear and perform the upload using it. Heads up! This won't work if something interferes with the board's USB communication so please, be sure to have resolved such issues as the conflict with ModemManager above.","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Getting_Started_with_Arduino_Leonardo.html"},{"title":"Pinout","text":"The embedded Arduino Leonardo-compatible input\/output (I\/O) pins operates at 5V, with a maximum 40 mA DC current per pin. They are located on the top of the board on a dual row dedicated female header(CN24). _ Make sure to check this image to know where are the corresponding Pins Technical specs From the Arduino Leonardo page: Microcontroller ATmega32u4 Operating Voltage 5V Digital I\/O Pins 20 PWM Channels 7 Analog Input Channels 12 DC Current per I\/O Pin 40 mA DC Current for 3.3V Pin 50 mA Flash Memory 32 KB (ATmega32u4) of which 4 KB used by bootloader SRAM 2.5 KB (ATmega32u4) EEPROM 1 KB (ATmega32u4) Clock Speed 16 MHz Each of the 20 digital i\/o pins on the Leonardo can be used as an input or output, using pinMode(), digitalWrite(), and digitalRead() functions. They operate at 5 volts. Each pin can provide or receive a maximum of 40 mA and has an internal pull-up resistor (disconnected by default) of 20-50 kOhms. There are six analog input pins at 10-bit resolution, providing a range of 1024 values between ground and 3.3 V. The number of inputs and resolution can be increased if required, by using an external ADC module. The Leonardo has 12 analog inputs, labeled A0 through A11, and all can also be used as digital i\/o. Pins A0-A5 appear in the same locations as on the Uno; inputs A6-A11 are on digital i\/o pins 4, 6, 8, 9, 10, and 12 respectively. Each analog input provides 10 bits of resolution (i.e. 1024 different values). By default the analog inputs measure from ground to 5 volts, though it’s possible to change the upper end of their range using the AREF pin and the analogReference() function. There is a built-in LED connected to digital pin 13. When the pin is HIGH value, the LED is on, when the pin is LOW, it's off Analog output is simulated using pulse width modulation (PWM) on digital pins 3, 5, 6, 8, 10, 11 and 13. For an explanation of PWM, refer to the following Arduino tutorial The pins 3 (interrupt 0), 2 (interrupt 1), 0 (interrupt 2), 1 (interrupt 3) and 7 (interrupt 4) can be configured to trigger an interrupt on a low value, a rising or falling edge, or a change in value. See the attachInterrupt() function for details. Grove connectors The UDOO BOLT features 3 Grove connectors to use Sensors and actuators from the Grove System by Seeed. The 3 Grove connectors are directly connected to the same pins of the external pinout. Grove Connector Conn. ID Signal Pins Grove Analog CN26 A0 - A1 Grove UART CN27 Rx\/D0 - Tx\/D1 Grove I2C CN28 SCL\/D3 - SDA\/D2 Arduino® Shields compatibility This is the first time that a UDOO board doesn't present the standard Arduino® Pinout, however, an esternal accessory is in design to let you use the UDOO BOLT I\/O Expansion Board to have the standard Arduino® Pinout and use the all the Arduino® shields you want. The UDOO BOLT I\/O Expansion Board will features a full Arduino® Leonardo Pinout including ICSP connector, RX and TX LEDs as well as the Reset Button, with the addition of an I2C Brick connector compatible with the Snap-in UDOO Bricks, i.e. the flexible sensors by UDOO which also are pluggable in a cascade configuration.","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Pinout.html"},{"title":"BIOS-UEFI Firmware","text":"UDOO BOLT is supplied with American Megatrends International LLC(AMI)'s BIOS\/UEFI Firmware. It is possible to access the AMI Setup Utility by pressing the escape key (ESC) after System power up, during POST phase. Heads up! Some wireless or mechanical keyboards that doesn't respect the standard USB HID protocol could doesn't work in the UEFI BIOS Firmware menu. Regarding the wireless keyboards we tested these that are proper working also in the UEFI BIOS menu: Logitech k400r, Logitech k400 plus, Microsoft All-in-One Media Keyboard. Please do NOT \"play\" with the BIOS-UEFI Firmware menu choices if you don't know what you are doing. For example, if you disable USB ports or Video Outputs you will not be able to interact with the BIOS-UEFI Firmware again to revert this condition. If you stumbling upon this case take a look at the Restore Factory configuration section below. Heads up! Since some resolutions or monitors are not managed well by the firmware, if you get a black screen when you try to enter in one of the UEFI Firmware Setup Utility Menu options, try using another Display with a 1920x1080 resolution (HDMI or DisplayPort) or a different cable. Heads up! Please, always keep updated the BIOS\/UEFI Firmware of your UDOO BOLT to have the latest features and bugfix available. UDOO BOLT Hardware and UEFI BIOS User Manual For a complete explanation of the System Configuration Utility menu items you can download the exhaustive UDOO BOLT Hardware and UEFI BIOS User Manual Restore Factory configuration In some cases, a wrong configuration of BIOS parameters could lead the module in an unusable state (i.e. no video output, all USB HID devices disabled). For these cases, on the module it has been placed a 3-way switch which can be used to restore the BIOS to factory default configuration. To do so, it is necessary to place the contact of the switch in 1-2 position, then turn on the module, wait until the board resets itself then turn off the module. The contact MUST be now placed back to 2-3 position. During normal use, the contact MUST be always placed in 2-3 position. You can restore the optimized factory default settings also from within the BIOS\/UEFI pressing the F3 key. Heads up! Updating the BIOS\/UEFI to a newer version will also restore the new factory default configuration.","tags":"","url":"BIOS_UEFI_and_Tools\/BIOS_UEFI_Firmware.html"},{"title":"BIOS-UEFI Update","text":"At the following link you can find the latest BIOS\/UEFI Firmware and the BIOS\/UEFI Update Utility to quickly and easily update the UDOO BOLT with the new BIOS\/UEFI Firmware version. Heads up! Please read carefully all the following information in this page and in the documentation file inside the package before to flash the new BIOS\/UEFI Please be aware that using Windows programmer, it must be run in a Prompt CMD shell or PowerShell with Administrator privileges. Using Linux programmer, every operation must be done with root\/administrator privileges and all the necessary to compile kernel modules is needed e.g. in Ubuntu 20.04 sudo apt install build-essential linux-headers-$(uname -r) flex bison Please read the following warnings: DO NOT POWER OFF the board while flashing. DO NOT interrupt the process while is running. Please use 19V Power Supply, not the USB-C power. After flashing is complete, power off the board, disconnect and reconnect the power cable. When you reconnect the power, wait up to 3 minutes and a couple of reboots until you see the newer version of the firmware of Embedded Controller and USB-C Controller in the configuration screen. It takes a few restarts for the update to be completely installed, and there's no visual feedback on that yet. In the meantime, the system and the boot phase might be slower. Download here the UEFI BIOS Firmware + Update Utility Tool package. The package contains: Latest UEFI Firmware binary BIOS version: 1.08 Release Date: 24\/04\/2020 SHA1 .zip file: EF37203F7CFB6DF4CB6807EF1CFA68975BFFB88C Update Utility Tool EFI shell programming utility Windows 32-bit BIOS programmer Windows 64-bit BIOS programmer Linux 32-bit programmer Linux 64-bit programmer Update procedure documentation (.pdf) Follow the procedure in the APN - BIOS programming using AFU.pdf file to update the BIOS\/UEFI BIOS firmware using Windows, EFI shell or Linux running on your UDOO BOLT. If you are one of the Kickstarter users and you see a Green Dot 🟢 on one side of the fan, please check the Fan Settings page. Note Remember that updating the BIOS\/UEFI firmware will revert the saved configuration to Factory Default.","tags":"","url":"BIOS_UEFI_and_Tools\/BIOS_UEFI_Update.html"},{"title":"EAPI","text":"EAPI (Embedded Application Programming Interface) is a framework developed by PICMG® for COM Express modules that gives a common API to unify software control for: System information Watchdog timer I2C Bus Flat Panel brightness control User storage area GPIO The EAPI definition is open to be used for other embedded form factors too, such as SBCs. Read the full specification here. Basically you need to include\/implement these libraries in you software code to communicate with the Embedded Controller and use the pinout functionalities. Download here the official implementation for UDOO BOLT. The package contains: Latest precompiled EAPI Libraries Test application (with sources) OS compatibility: Windows 32-bit Windows 64-bit Linux 32-bit Linux 64-bit Revision version: 1.8 Release Date: 2019-11-07 SHA1 .zip file: 504F790ADBFA1FF690ECB48275C59A5A19F04C55 Official Documentation inside the package (.pdf)","tags":"","url":"BIOS_UEFI_and_Tools\/EAPI.html"},{"title":"Fan Settings","text":"Overview On this page you will find some information and tips about the fan above the heatsink of the processor. The fan that cools the Ryzen™ processor of the UDOO BOLT is a 5V powered fan with PWM signal speed management and is managed entirely by the board's Embedded Controller. The full management of the fan settings described below is possible starting from BIOS\/UEFI Firmware version 1.07. Heads up! Please, always keep updated the BIOS\/UEFI Firmware of your UDOO BOLT to have the latest features and bugfix available. BIOS\/UEFI Fan Settings Here a detailed description of the fan settings and its default values. Advanced --&gt; Embedded Controller --&gt; Internal Fan settings Enhanced 3 wire RPM measurement &lt;Disabled&gt; Automatic Temperature FAN Control &lt;Enabled&gt; AC0 Temperature (C) &lt;85&gt; AC1 Temperature (C) &lt;70&gt; Temperature Hysteresis 5 FAN Duty Cycle (%) Above AC1 35 Speed change duration 0 Enhanced 3 wire RPM measurement refers to an algorithm necessary for the consistent reading of the current fan speed to respond to the tachometer signal. This data is made available by EAPI libraries. The algorithm set the speed fan to 100% for 100 milliseconds every 3 seconds. This is the standard way for the 3 wires fan to have a consistent reading of the speed. By default it is disabled because it can create a perceptible non-linear motion sound effect on some fans or some assembly situations. AC0 Temperature indicates the temperature above which the fan start turns on at full 100% rotation speed. AC1 Temperature indicates the temperature above which the fan start turns on at the % rotation speed indicated by the FAN Duty Cycle (%) Above AC1 value. Temperature Hysteresis This value is added to AC0 and AC1 when temperature is growing and subtracted when it is lowering to avoid oscillation. FAN Duty Cycle (%) Above AC1 is the percentage speed at which the fan turns when the processor's temperature is in the range between AC1 and AC0. Speed change duration indicates the time with which the speed changes linearly from one speed value to another (it is a ramp in practice, if set to 0 the fan will start directly at the right speed, if other values are set the fan will start more slowly and arrive at the selected speed more gradually). Info Preset values above are designed for a normal desktop working environment. These settings help minimize fan noise while keeping the system properly cooled in a normal working environment. The default settings may be modified in future BIOS revisions as UDOO continues to fine-tune them to get the best trade-off between cooling and fan acoustics. You may need to change the fan settings if your usage model includes any of the following: Heavy image\/video processing or analysis. Gaming, Stress testing or Benchmarking. Sustained processor usage of 75% or higher, for a long period. If you are in one of these usage scenarios, we suggest raising the value of FAN Duty Cycle % Above AC1 and lowering the AC1 Temperature and AC0 Temperature to maintain a lower processor operating temperature and be sure to always use maximum performance. if the fan is changed to one that does not handle PWM rotation speed, it is important for proper fan operation to set the values for FAN Duty Cycle % Above AC1 to 100 and Speed change duration to 0. If you are one of the Kickstarter users and you see a Green Dot 🟢 on one side of the fan, your fan is not handling the PWM speed correctly, so please set the FAN Duty Cycle % Above AC1 to 100 and Speed change duration to 0. If you still have a problem with this fan after applying these settings, please open a ticket in the customer care support center.","tags":"","url":"BIOS_UEFI_and_Tools\/Fan_Settings.html"},{"title":"Troubleshooting","text":"If you find any problem in the proper working of UDOO BOLT, please consult this section. My UDOO BOLT doesn't boot or restart itself continuously If your UDOO BOLT does NOT boot or restarts all the time, please check the following points: When the power jack is inserted the board does not start automatically. The power status LED is yellow\/amber\/orange and the board is in the power off state. To turn on UDOO BOLT you have to press the small power button on the front of the board. The status LED turns green when the board is powered on. Check the power button position in the Hardware Reference - Overview page. Check the power source you are applying to UDOO BOLT. Please, follow the Power Sources page or consult the User Manual to learn more about the power supply needed by the board for normal operation. Check that the restore factory configuration switch is in the right position for normal operation, otherwise the board will restart continuously. You can find info about that switch in the BIOS-UEFI Firmware page or consulting the User Manual. Try detaching all peripherals connected to UDOO BOLT except RAM and video cable. You should be able to see the UDOO LOGO and the first page of the BIOS. If you are using 2 RAM modules, try using only one RAM module at a time in the socket closest to the heatsink. If the card does not boot with either RAM modules, try using one RAM module at a time in the other socket, the one farthest from the heatsink. This is useful to rule out a problem with one of the RAM modules or one of the RAM sockets. I see an orange LED (D13) blinking The D13 orange LED you see is the standard Arduino LED 13. The Arduino® microcontroller (ATmega32U4) onboardM comes with an Arduino sketch (firmware) preinstalled that just blink the LED every 1 second. This is the standard Arduino first example and it is used in the board testing phase to check if the microcontroller side and communication works properly. The Fan on top of the heatsink has a strange behaviour If you are one of the Kickstarter users and you see a Green Dot 🟢 on one side of the fan, please check the warnings in Fan Settings page to know how to configure the BIOS settings for your fan. An incorrect configuration can also cause the UDOO BOLT to shut down because it cannot dissipate heat properly. Blue Screen stop errors occur on my Windows installation. If you have installed Windows on an external drive (M.2 or SATA) and occasionally there are Blue Screen stop error events (commonly called BSOD) the problem may be related to a strange behavior of the Windows eMMC driver that throws sporadic errors in memory access. This behavior is more frequent when the UDOO BOLT is in idle state. We suggest not using eMMC memory and disable it from the Device Manager. To do so: right click on Start -&gt; Device Manager -&gt; Expand the section &quot;Disk drives&quot; -&gt; right click on SanDisk DF4032 -&gt; click on &quot;Disable&quot;. I can't install Linux distros on eMMC If you are trying to install a Linux distribution on the UDOO BOLT eMMC but it is not seen by the installer wizard, please follow the eMMC Usage and Installations section in the Linux - Known issues page. Probably the Linux distro you are trying to install use a Linux Kernel older than the 5.2.5 version. A Ubuntu 19.04 optimized version for UDOO BOLT that solves this issue is downloadable from the Linux section. However, newer Ubuntu version like the 19.10 or 20.04 allow the installation on the eMMC because already integrates a version of the Linux Kernel later than 5.2.5. I can't upload sketches to Arduino Leonardo onboard If you have any trouble uploading Arduino sketches running Linux, check the Linux - known issues section in the Getting Started with Arduino Leonardo page. Here you can find a procedure for trying to restore the correct uploading state of sketches.","tags":"","url":"Troubleshooting\/index.html"}]}